# -*- coding: utf-8 -*-
import configparser as ConfigParser
import pandas as pd
import numpy as np
import string
import os
import sys
import xlrd
import xlwt
masterSubject=[5,0,2,0,0,0,2,1,1,3,0,2,0,2,2,0,1,0]
classA=[6,6,5,2,2,3,2,3,1,1,1,1,1]
classB=[11,5,5,2,2,3,2,2,1,1,1,1,1]
classWeight={'语文':3,'数 学':3, '英语':3, '政 治':2, '生 物':2, '历 史':2, '地 理':2, '体 育':1, '音 乐':1, '美 术':1, '健 康':1, '信 息':1, '综合实践':1}
masterteacherSubject=['历 史','语文','英语','语文','语文','语文', '英语','数 学','数 学','政 治','语文','英语','语文','英语','英语','语文', '语文','数 学' ]
masterTeacherList=['武广英', '徐盛轶', '张瑞华', '耿  欢', '傅婷婷', '程马利', '樊妍妍', '李  琴', '常  昊', '胡小丽', '王  晓', '高秀芳', '张银玉', '许  阳', '张  靖', '刘国栋', '王克燕', '卫  奇']
def excelRead():
	teacherExcel=pd.read_excel("C:/Users/sky/Desktop/课表/2019.9月人事安排表(2019.8.25).xlsx", encoding='UTF-8')
	# data=teacherExcel.loc[:,["班级"]]
	# print(teacherExcel.loc[[0,17]])
	# print(teacherExcel.loc[:,["班主任"]].values)
	# print(len(teacherExcel.columns.values))
	# print(np.delete(teacherExcel.columns.values,0))
	# # print(teacherExcel.columns.values[16])
	# print(teacherExcel.loc[:,teacherExcel.columns.values[0]].values)
	print(teacherExcel.loc[0].values)
	print(type(teacherExcel.loc[0].values))
def conf():
	conf_par = ConfigParser.RawConfigParser(allow_no_value=True)
	conf_par.read("config.conf", encoding='UTF-8')
	all_sections = conf_par.sections()
	try:
		# 所有模块
		print(all_sections)
		# 获取所有options
		print(conf_par.options("班主任"))
		print(conf_par.options("班主任")[1])

		# 获取对应的值
		print(conf_par.get("班主任","武广英"))
	except ConfigParser.NoOptionError:
		print(ConfigParser.NoOptionError)


def classTakeOutMaster(classNum):
    # 班级号是从1开始的
    if classNum<=4:
        classSubjectNum = classA.copy()
        classSubjectNum[masterSubject[classNum-1]]=classSubjectNum[masterSubject[classNum-1]]-1
        return classSubjectNum
    else:
        classSubjectNum = classB.copy()
        classSubjectNum[masterSubject[classNum-1]] = classSubjectNum[masterSubject[classNum-1]] - 1
        return classSubjectNum
def NumToList(numList):
	lastSubjectList=[]
	for num in numList:
		a=[num//5]*(5-num%5)
		b=[num//5+1]*(num%5)
		c=a+b
		lastSubjectList.append(c)
	return lastSubjectList

class mycopy():
	def __init__(self):
		self.copyTest()

	def copyTest(self):
		self.a={'name':[1,2,3,4]}

def test1(argu):
	d=argu.a.copy()
	c=d.copy()
	print(argu.a)
	c['name'].remove(1)
	print(c)
	print(argu.a)

def numToDay(numList):
	dayList={}
	for i in numList:
		i=i-1
		if i//8 in dayList.keys():
			dayList[i//8].append(i%8)
		else:
			dayList.update({i//8:[i%8]})
	# print(dayList)
	# print(dayList.keys())
	# print(len(dayList))
	# print(list(dayList.keys())[1])
	return dayList


def excelWrite(classdict,masterTeacherList,excelName):
	book = xlwt.Workbook()  # 新建一个excel
	titleRow = ["星期一", "星期二", "星期三", "星期四", "星期五"]
	titleCol = ["第1节", "第2节", "第3节", "第4节", "第5节", "第6节", "第7节", "第8节"]
	sheet = book.add_sheet("班")
	for classNum in classdict:
		rowIdex=((classNum-1)//3)*11
		colIndex=((classNum-1)%3)*8
		sheet.write(rowIdex+1, colIndex+1,masterTeacherList[classNum-1])
		sheet.write(rowIdex,colIndex,str(classNum)+"班")
		row=rowIdex
		while(row<=7+rowIdex):
			sheet.write(row+1,colIndex,titleCol[row-rowIdex])
			row=row+1
		col=colIndex
		while(col<=4+colIndex):
			sheet.write(rowIdex,col+1,titleRow[col-colIndex])
			col=col+1
		for timeNum in classdict[classNum]:
			sheet.write((timeNum-1)%8+1+rowIdex,(timeNum-1)//8+1+colIndex,classdict[classNum][timeNum])
	book.save('C:/Users/sky/Desktop/课表/'+excelName+'.xls')

def checkWight(classPlan):
    best=0
    for classNum in classPlan.keys():
        for courseNum in classPlan[classNum].keys():
            best=best+((courseNum-1)%8+1)*classWeight[classPlan[classNum][courseNum]]
    return best

if __name__ == '__main__':
	# excelRead()
	# a={"班主任":[{"qq":[1,2]},{"ww":[3,4]}]}
	# print(a["班主任"][0]["qq"])
	# b=mycopy()
	# # print(b.a)
	# # c=b.a.copy()
	# # c.remove(1)
	# # print(b.a)
	# test1(b)
	# b = mycopy()
	# test1(b)
	# a=[1,3,5,7,9,34,23,8,40,24,37]
	# numToDay(a)
	# i=1
	# while(i<=18):
	# 	print(i)
	# 	test=classTakeOutMaster(i)
	# 	print(test)
	# 	print(NumToList(test))
	# 	i=i+1
	whileIndex=[{1: {4: '语文', 15: '语文', 18: '语文', 27: '语文', 34: '语文', 37: '语文', 2: '数 学', 9: '数 学', 20: '数 学', 22: '数 学', 32: '数 学', 40: '数 学', 6: '英语', 16: '英语', 21: '英语', 26: '英语', 38: '英语', 5: '政 治', 33: '政 治', 19: '生 物', 36: '生 物', 17: '历 史', 39: '历 史', 7: '地 理', 11: '地 理', 29: '体 育', 3: '体 育', 10: '体 育', 35: '音 乐', 31: '美 术', 30: '健 康', 28: '信 息', 12: '综合实践'}, 2: {4: '语文', 14: '语文', 21: '语文', 30: '语文', 39: '语文', 7: '数 学', 3: '数 学', 9: '数 学', 19: '数 学', 32: '数 学', 37: '数 学', 5: '英语', 11: '英语', 18: '英语', 25: '英语', 38: '英语', 28: '政 治', 40: '政 治', 33: '生 物', 12: '生 物', 6: '历 史', 36: '历 史', 27: '历 史', 17: '地 理', 2: '地 理', 22: '体 育', 35: '体 育', 31: '体 育', 29: '音 乐', 20: '美 术', 34: '健 康', 26: '信 息', 10: '综合实践'}, 3: {2: '语文', 5: '语文', 9: '语文', 19: '语文', 29: '语文', 38: '语文', 7: '数 学', 10: '数 学', 21: '数 学', 30: '数 学', 37: '数 学', 40: '数 学', 12: '英语', 17: '英语', 25: '英语', 34: '英语', 36: '政 治', 28: '政 治', 26: '生 物', 4: '生 物', 35: '历 史', 18: '历 史', 6: '历 史', 31: '地 理', 15: '地 理', 33: '体 育', 27: '体 育', 14: '体 育', 39: '音 乐', 32: '美 术', 16: '健 康', 13: '信 息', 11: '综合实践'}, 4: {5: '语文', 11: '语文', 20: '语文', 28: '语文', 35: '语文', 4: '数 学', 15: '数 学', 9: '数 学', 17: '数 学', 27: '数 学', 33: '数 学', 2: '英语', 10: '英语', 21: '英语', 30: '英语', 37: '英语', 34: '政 治', 13: '政 治', 40: '生 物', 16: '生 物', 26: '历 史', 38: '历 史', 7: '历 史', 3: '地 理', 39: '地 理', 25: '体 育', 19: '体 育', 36: '体 育', 32: '音 乐', 6: '美 术', 14: '健 康', 12: '信 息', 29: '综合实践'}, 5: {4: '语文', 2: '语文', 9: '语文', 11: '语文', 21: '语文', 17: '语文', 28: '语文', 25: '语文', 38: '语文', 40: '语文', 6: '数 学', 10: '数 学', 22: '数 学', 32: '数 学', 36: '数 学', 5: '英语', 15: '英语', 20: '英语', 29: '英语', 33: '英语', 7: '政 治', 31: '政 治', 35: '生 物', 3: '生 物', 16: '历 史', 34: '历 史', 30: '历 史', 12: '地 理', 26: '地 理', 14: '体 育', 27: '体 育', 19: '音 乐', 37: '美 术', 13: '健 康', 39: '信 息', 18: '综合实践'}, 6: {7: '语文', 3: '语文', 9: '语文', 10: '语文', 19: '语文', 17: '语文', 29: '语文', 26: '语文', 35: '语文', 38: '语文', 6: '数 学', 16: '数 学', 22: '数 学', 32: '数 学', 39: '数 学', 4: '英语', 14: '英语', 20: '英语', 25: '英语', 40: '英语', 30: '政 治', 37: '政 治', 34: '生 物', 15: '生 物', 33: '历 史', 18: '历 史', 12: '历 史', 5: '地 理', 13: '地 理', 31: '体 育', 36: '体 育', 21: '音 乐', 11: '美 术', 2: '健 康', 27: '信 息', 28: '综合实践'}, 7: {3: '语文', 5: '语文', 12: '语文', 15: '语文', 9: '语文', 18: '语文', 20: '语文', 27: '语文', 30: '语文', 37: '语文', 36: '语文', 6: '数 学', 11: '数 学', 22: '数 学', 31: '数 学', 40: '数 学', 7: '英语', 10: '英语', 19: '英语', 33: '英语', 17: '政 治', 35: '政 治', 4: '生 物', 28: '生 物', 2: '历 史', 21: '历 史', 26: '历 史', 38: '地 理', 29: '地 理', 25: '体 育', 16: '体 育', 34: '音 乐', 39: '美 术', 32: '健 康', 14: '信 息', 13: '综合实践'}, 8: {7: '语文', 4: '语文', 11: '语文', 16: '语文', 15: '语文', 19: '语文', 21: '语文', 28: '语文', 26: '语文', 36: '语文', 38: '语文', 13: '数 学', 18: '数 学', 25: '数 学', 35: '数 学', 5: '英语', 14: '英语', 20: '英语', 27: '英语', 40: '英语', 6: '政 治', 32: '政 治', 37: '生 物', 31: '生 物', 29: '历 史', 17: '历 史', 10: '历 史', 22: '地 理', 12: '地 理', 2: '体 育', 30: '体 育', 33: '音 乐', 34: '美 术', 3: '健 康', 9: '信 息', 39: '综合实践'}, 9: {3: '语文', 6: '语文', 10: '语文', 9: '语文', 14: '语文', 21: '语文', 19: '语文', 28: '语文', 27: '语文', 34: '语文', 39: '语文', 7: '数 学', 17: '数 学', 25: '数 学', 35: '数 学', 5: '英语', 11: '英语', 18: '英语', 32: '英语', 37: '英语', 13: '政 治', 38: '政 治', 12: '生 物', 22: '生 物', 4: '历 史', 20: '历 史', 33: '历 史', 31: '地 理', 15: '地 理', 26: '体 育', 40: '体 育', 30: '音 乐', 16: '美 术', 2: '健 康', 36: '信 息', 29: '综合实践'}, 10: {7: '语文', 2: '语文', 15: '语文', 9: '语文', 11: '语文', 17: '语文', 18: '语文', 32: '语文', 26: '语文', 34: '语文', 33: '语文', 6: '数 学', 10: '数 学', 19: '数 学', 25: '数 学', 39: '数 学', 3: '英语', 14: '英语', 22: '英语', 28: '英语', 38: '英语', 40: '政 治', 5: '生 物', 13: '生 物', 35: '历 史', 31: '历 史', 16: '历 史', 20: '地 理', 4: '地 理', 12: '体 育', 37: '体 育', 27: '音 乐', 36: '美 术', 29: '健 康', 21: '信 息', 30: '综合实践'}, 11: {2: '语文', 5: '语文', 11: '语文', 9: '语文', 18: '语文', 19: '语文', 30: '语文', 27: '语文', 34: '语文', 37: '语文', 3: '数 学', 13: '数 学', 17: '数 学', 28: '数 学', 38: '数 学', 4: '英语', 15: '英语', 21: '英语', 29: '英语', 35: '英语', 7: '政 治', 22: '政 治', 32: '生 物', 39: '生 物', 6: '历 史', 25: '历 史', 40: '历 史', 36: '地 理', 26: '地 理', 33: '体 育', 20: '体 育', 31: '音 乐', 10: '美 术', 12: '健 康', 16: '信 息', 14: '综合实践'}, 12: {4: '语文', 5: '语文', 12: '语文', 9: '语文', 21: '语文', 22: '语文', 29: '语文', 30: '语文', 25: '语文', 37: '语文', 39: '语文', 6: '数 学', 16: '数 学', 20: '数 学', 26: '数 学', 34: '数 学', 7: '英语', 19: '英语', 32: '英语', 38: '英语', 40: '政 治', 10: '政 治', 35: '生 物', 14: '生 物', 27: '历 史', 11: '历 史', 17: '历 史', 33: '地 理', 28: '地 理', 15: '体 育', 18: '体 育', 36: '音 乐', 3: '美 术', 13: '健 康', 2: '信 息', 31: '综合实践'}, 13: {7: '语文', 6: '语文', 9: '语文', 11: '语文', 20: '语文', 21: '语文', 25: '语文', 29: '语文', 35: '语文', 40: '语文', 3: '数 学', 16: '数 学', 19: '数 学', 31: '数 学', 37: '数 学', 5: '英语', 10: '英语', 17: '英语', 30: '英语', 33: '英语', 38: '政 治', 12: '政 治', 15: '生 物', 26: '生 物', 13: '历 史', 2: '历 史', 18: '历 史', 32: '地 理', 39: '地 理', 27: '体 育', 36: '体 育', 22: '音 乐', 34: '美 术', 28: '健 康', 14: '信 息', 4: '综合实践'}, 14: {3: '语文', 7: '语文', 14: '语文', 9: '语文', 19: '语文', 21: '语文', 31: '语文', 32: '语文', 27: '语文', 40: '语文', 34: '语文', 5: '数 学', 10: '数 学', 18: '数 学', 28: '数 学', 35: '数 学', 12: '英语', 17: '英语', 25: '英语', 38: '英语', 6: '政 治', 15: '政 治', 37: '生 物', 20: '生 物', 22: '历 史', 29: '历 史', 36: '历 史', 11: '地 理', 2: '地 理', 30: '体 育', 4: '体 育', 33: '音 乐', 39: '美 术', 16: '健 康', 26: '信 息', 13: '综合实践'}, 15: {2: '语文', 7: '语文', 14: '语文', 12: '语文', 10: '语文', 19: '语文', 21: '语文', 30: '语文', 29: '语文', 33: '语文', 36: '语文', 3: '数 学', 11: '数 学', 22: '数 学', 32: '数 学', 34: '数 学', 5: '英语', 15: '英语', 18: '英语', 31: '英语', 16: '政 治', 26: '政 治', 4: '生 物', 13: '生 物', 6: '历 史', 27: '历 史', 40: '历 史', 17: '地 理', 25: '地 理', 20: '体 育', 39: '体 育', 35: '音 乐', 9: '美 术', 28: '健 康', 38: '信 息', 37: '综合实践'}, 16: {5: '语文', 7: '语文', 10: '语文', 9: '语文', 19: '语文', 20: '语文', 31: '语文', 29: '语文', 40: '语文', 34: '语文', 3: '数 学', 15: '数 学', 17: '数 学', 25: '数 学', 38: '数 学', 4: '英语', 11: '英语', 21: '英语', 26: '英语', 37: '英语', 30: '政 治', 22: '政 治', 27: '生 物', 12: '生 物', 32: '历 史', 33: '历 史', 18: '历 史', 6: '地 理', 14: '地 理', 16: '体 育', 2: '体 育', 13: '音 乐', 35: '美 术', 36: '健 康', 28: '信 息', 39: '综合实践'}, 17: {7: '语文', 4: '语文', 12: '语文', 15: '语文', 11: '语文', 20: '语文', 21: '语文', 27: '语文', 26: '语文', 38: '语文', 39: '语文', 5: '数 学', 10: '数 学', 22: '数 学', 40: '数 学', 6: '英语', 9: '英语', 18: '英语', 30: '英语', 37: '英语', 34: '政 治', 19: '政 治', 17: '生 物', 31: '生 物', 3: '历 史', 13: '历 史', 25: '历 史', 16: '地 理', 35: '地 理', 28: '体 育', 33: '体 育', 29: '音 乐', 36: '美 术', 14: '健 康', 32: '信 息', 2: '综合实践'}, 18: {4: '语文', 5: '语文', 15: '语文', 16: '语文', 17: '语文', 19: '语文', 26: '语文', 31: '语文', 33: '语文', 36: '语文', 7: '数 学', 12: '数 学', 18: '数 学', 28: '数 学', 34: '数 学', 2: '英语', 11: '英语', 20: '英语', 27: '英语', 38: '英语', 10: '政 治', 29: '政 治', 9: '生 物', 21: '生 物', 14: '历 史', 37: '历 史', 30: '历 史', 39: '地 理', 3: '地 理', 13: '体 育', 22: '体 育', 32: '音 乐', 6: '美 术', 25: '健 康', 40: '信 息', 35: '综合实践'}}, {1: {4: '耿  欢', 15: '耿  欢', 18: '耿  欢', 27: '耿  欢', 34: '耿  欢', 37: '耿  欢', 2: '赵天珍', 9: '赵天珍', 20: '赵天珍', 22: '赵天珍', 32: '赵天珍', 40: '赵天珍', 6: '李冬梅', 16: '李冬梅', 21: '李冬梅', 26: '李冬梅', 38: '李冬梅', 5: '胡小丽', 33: '胡小丽', 19: '李秀萍', 36: '李秀萍', 17: '武广英', 39: '武广英', 7: '黄丽娟', 11: '黄丽娟', 29: '王  瑞', 3: '王  瑞', 10: '王  瑞', 35: '张  艳', 31: '刘  敏', 30: '邵梦婷', 28: '李雪芹', 12: '刘  婧'}, 2: {4: '徐盛轶', 14: '徐盛轶', 21: '徐盛轶', 30: '徐盛轶', 39: '徐盛轶', 7: '李  琴', 3: '李  琴', 9: '李  琴', 19: '李  琴', 32: '李  琴', 37: '李  琴', 5: '席志扬', 11: '席志扬', 18: '席志扬', 25: '席志扬', 38: '席志扬', 28: '孟  燕', 40: '孟  燕', 33: '李秀萍', 12: '李秀萍', 6: '武广英', 36: '武广英', 27: '武广英', 17: '黄丽娟', 2: '黄丽娟', 22: '王  瑞', 35: '王  瑞', 31: '王  瑞', 29: '张  艳', 20: '刘  敏', 34: '邵梦婷', 26: '李雪芹', 10: '刘  婧'}, 3: {2: '徐盛轶', 5: '徐盛轶', 9: '徐盛轶', 19: '徐盛轶', 29: '徐盛轶', 38: '徐盛轶', 7: '曹卫兵', 10: '曹卫兵', 21: '曹卫兵', 30: '曹卫兵', 37: '曹卫兵', 40: '曹卫兵', 12: '张瑞华', 17: '张瑞华', 25: '张瑞华', 34: '张瑞华', 36: '胡小丽', 28: '胡小丽', 26: '徐  冉', 4: '徐  冉', 35: '尹淑英', 18: '尹淑英', 6: '尹淑英', 31: '黄丽娟', 15: '黄丽娟', 33: '王  瑞', 27: '王  瑞', 14: '王  瑞', 39: '张  艳', 32: '刘  敏', 16: '邵梦婷', 13: '李雪芹', 11: '刘  婧'}, 4: {5: '耿  欢', 11: '耿  欢', 20: '耿  欢', 28: '耿  欢', 35: '耿  欢', 4: '田月红', 15: '田月红', 9: '田月红', 17: '田月红', 27: '田月红', 33: '田月红', 2: '王奕涵', 10: '王奕涵', 21: '王奕涵', 30: '王奕涵', 37: '王奕涵', 34: '孟  燕', 13: '孟  燕', 40: '李秀萍', 16: '李秀萍', 26: '武广英', 38: '武广英', 7: '武广英', 3: '黄丽娟', 39: '黄丽娟', 25: '王  瑞', 19: '王  瑞', 36: '王  瑞', 32: '张  艳', 6: '刘  敏', 14: '邵梦婷', 12: '李雪芹', 29: '刘  婧'}, 5: {4: '傅婷婷', 2: '傅婷婷', 9: '傅婷婷', 11: '傅婷婷', 21: '傅婷婷', 17: '傅婷婷', 28: '傅婷婷', 25: '傅婷婷', 38: '傅婷婷', 40: '傅婷婷', 6: '雷桂敏', 10: '雷桂敏', 22: '雷桂敏', 32: '雷桂敏', 36: '雷桂敏', 5: '袁  彬', 15: '袁  彬', 20: '袁  彬', 29: '袁  彬', 33: '袁  彬', 7: '胡小丽', 31: '胡小丽', 35: '李秀萍', 3: '李秀萍', 16: '武广英', 34: '武广英', 30: '武广英', 12: '黄丽娟', 26: '黄丽娟', 14: '马韶佳', 27: '马韶佳', 19: '张  艳', 37: '刘  敏', 13: '邵梦婷', 39: '李雪芹', 18: '刘  婧'}, 6: {7: '程马利', 3: '程马利', 9: '程马利', 10: '程马利', 19: '程马利', 17: '程马利', 29: '程马利', 26: '程马利', 35: '程马利', 38: '程马利', 6: '王  莉', 16: '王  莉', 22: '王  莉', 32: '王  莉', 39: '王  莉', 4: '樊妍妍', 14: '樊妍妍', 20: '樊妍妍', 25: '樊妍妍', 40: '樊妍妍', 30: '胡小丽', 37: '胡小丽', 34: '李秀萍', 15: '李秀萍', 33: '武广英', 18: '武广英', 12: '武广英', 5: '黄丽娟', 13: '黄丽娟', 31: '马韶佳', 36: '马韶佳', 21: '张  艳', 11: '刘  敏', 2: '邵梦婷', 27: '李雪芹', 28: '刘  婧'}, 7: {3: '崔  媛', 5: '崔  媛', 12: '崔  媛', 15: '崔  媛', 9: '崔  媛', 18: '崔  媛', 20: '崔  媛', 27: '崔  媛', 30: '崔  媛', 37: '崔  媛', 36: '崔  媛', 6: '闫海萍', 11: '闫海萍', 22: '闫海萍', 31: '闫海萍', 40: '闫海萍', 7: '樊妍妍', 10: '樊妍妍', 19: '樊妍妍', 33: '樊妍妍', 17: '胡小丽', 35: '胡小丽', 4: '王  芳', 28: '王  芳', 2: '刘  洋', 21: '刘  洋', 26: '刘  洋', 38: '黄丽娟', 29: '黄丽娟', 25: '马韶佳', 16: '马韶佳', 34: '张  艳', 39: '韩  晓', 32: '邵梦婷', 14: '李雪芹', 13: '刘  婧'}, 8: {7: '王  慧', 4: '王  慧', 11: '王  慧', 16: '王  慧', 15: '王  慧', 19: '王  慧', 21: '王  慧', 28: '王  慧', 26: '王  慧', 36: '王  慧', 38: '王  慧', 13: '李  琴', 18: '李  琴', 25: '李  琴', 35: '李  琴', 5: '王奕涵', 14: '王奕涵', 20: '王奕涵', 27: '王奕涵', 40: '王奕涵', 6: '蔡晓娟', 32: '蔡晓娟', 37: '王  芳', 31: '王  芳', 29: '刘  洋', 17: '刘  洋', 10: '刘  洋', 22: '严承磊', 12: '严承磊', 2: '马韶佳', 30: '马韶佳', 33: '张  艳', 34: '韩  晓', 3: '邵梦婷', 9: '李雪芹', 39: '刘  婧'}, 9: {3: '张  洁', 6: '张  洁', 10: '张  洁', 9: '张  洁', 14: '张  洁', 21: '张  洁', 19: '张  洁', 28: '张  洁', 27: '张  洁', 34: '张  洁', 39: '张  洁', 7: '常  昊', 17: '常  昊', 25: '常  昊', 35: '常  昊', 5: '李冬梅', 11: '李冬梅', 18: '李冬梅', 32: '李冬梅', 37: '李冬梅', 13: '胡小丽', 38: '胡小丽', 12: '王  芳', 22: '王  芳', 4: '刘  洋', 20: '刘  洋', 33: '刘  洋', 31: '严承磊', 15: '严承磊', 26: '马韶佳', 40: '马韶佳', 30: '张  艳', 16: '韩  晓', 2: '张丽丽', 36: '李雪芹', 29: '于德顺'}, 10: {7: '邓春燕', 2: '邓春燕', 15: '邓春燕', 9: '邓春燕', 11: '邓春燕', 17: '邓春燕', 18: '邓春燕', 32: '邓春燕', 26: '邓春燕', 34: '邓春燕', 33: '邓春燕', 6: '赵天珍', 10: '赵天珍', 19: '赵天珍', 25: '赵天珍', 39: '赵天珍', 3: '张瑞华', 14: '张瑞华', 22: '张瑞华', 28: '张瑞华', 38: '张瑞华', 40: '胡小丽', 5: '王  芳', 13: '王  芳', 35: '刘  洋', 31: '刘  洋', 16: '刘  洋', 20: '严承磊', 4: '严承磊', 12: '马韶佳', 37: '马韶佳', 27: '张  艳', 36: '韩  晓', 29: '张丽丽', 21: '李雪芹', 30: '于德顺'}, 11: {2: '王  晓', 5: '王  晓', 11: '王  晓', 9: '王  晓', 18: '王  晓', 19: '王  晓', 30: '王  晓', 27: '王  晓', 34: '王  晓', 37: '王  晓', 3: '闫海萍', 13: '闫海萍', 17: '闫海萍', 28: '闫海萍', 38: '闫海萍', 4: '许  阳', 15: '许  阳', 21: '许  阳', 29: '许  阳', 35: '许  阳', 7: '蔡晓娟', 22: '蔡晓娟', 32: '王  芳', 39: '王  芳', 6: '刘  洋', 25: '刘  洋', 40: '刘  洋', 36: '严承磊', 26: '严承磊', 33: '马韶佳', 20: '马韶佳', 31: '张  艳', 10: '韩  晓', 12: '张丽丽', 16: '李雪芹', 14: '于德顺'}, 12: {4: '虎生梅', 5: '虎生梅', 12: '虎生梅', 9: '虎生梅', 21: '虎生梅', 22: '虎生梅', 29: '虎生梅', 30: '虎生梅', 25: '虎生梅', 37: '虎生梅', 39: '虎生梅', 6: '常  昊', 16: '常  昊', 20: '常  昊', 26: '常  昊', 34: '常  昊', 7: '高秀芳', 19: '高秀芳', 32: '高秀芳', 38: '高秀芳', 40: '蔡晓娟', 10: '蔡晓娟', 35: '孙爱霞', 14: '孙爱霞', 27: '葛雅卉', 11: '葛雅卉', 17: '葛雅卉', 33: '严承磊', 28: '严承磊', 15: '李耀国', 18: '李耀国', 36: '张文辉', 3: '韩  晓', 13: '张丽丽', 2: '李雪芹', 31: '于德顺'}, 13: {7: '张银玉', 6: '张银玉', 9: '张银玉', 11: '张银玉', 20: '张银玉', 21: '张银玉', 25: '张银玉', 29: '张银玉', 35: '张银玉', 40: '张银玉', 3: '王克燕', 16: '王克燕', 19: '王克燕', 31: '王克燕', 37: '王克燕', 5: '高秀芳', 10: '高秀芳', 17: '高秀芳', 30: '高秀芳', 33: '高秀芳', 38: '孟  燕', 12: '孟  燕', 15: '孙爱霞', 26: '孙爱霞', 13: '葛雅卉', 2: '葛雅卉', 18: '葛雅卉', 32: '严承磊', 39: '严承磊', 27: '李耀国', 36: '李耀国', 22: '张文辉', 34: '马  强', 28: '张丽丽', 14: '许  莉', 4: '于德顺'}, 14: {3: '马  伟', 7: '马  伟', 14: '马  伟', 9: '马  伟', 19: '马  伟', 21: '马  伟', 31: '马  伟', 32: '马  伟', 27: '马  伟', 40: '马  伟', 34: '马  伟', 5: '王  莉', 10: '王  莉', 18: '王  莉', 28: '王  莉', 35: '王  莉', 12: '许  阳', 17: '许  阳', 25: '许  阳', 38: '许  阳', 6: '孟  燕', 15: '孟  燕', 37: '孙爱霞', 20: '孙爱霞', 22: '鄢雪峰', 29: '鄢雪峰', 36: '鄢雪峰', 11: '严承磊', 2: '严承磊', 30: '李耀国', 4: '李耀国', 33: '张文辉', 39: '马  强', 16: '马  萍', 26: '许  莉', 13: '于德顺'}, 15: {2: '张  菲', 7: '张  菲', 14: '张  菲', 12: '张  菲', 10: '张  菲', 19: '张  菲', 21: '张  菲', 30: '张  菲', 29: '张  菲', 33: '张  菲', 36: '张  菲', 3: '田月红', 11: '田月红', 22: '田月红', 32: '田月红', 34: '田月红', 5: '张  靖', 15: '张  靖', 18: '张  靖', 31: '张  靖', 16: '孟  燕', 26: '孟  燕', 4: '孙爱霞', 13: '孙爱霞', 6: '鄢雪峰', 27: '鄢雪峰', 40: '鄢雪峰', 17: '张丽丽', 25: '张丽丽', 20: '李耀国', 39: '李耀国', 35: '张文辉', 9: '马  强', 28: '马  萍', 38: '许  莉', 37: '于德顺'}, 16: {5: '刘国栋', 7: '刘国栋', 10: '刘国栋', 9: '刘国栋', 19: '刘国栋', 20: '刘国栋', 31: '刘国栋', 29: '刘国栋', 40: '刘国栋', 34: '刘国栋', 3: '齐苡敏', 15: '齐苡敏', 17: '齐苡敏', 25: '齐苡敏', 38: '齐苡敏', 4: '张  靖', 11: '张  靖', 21: '张  靖', 26: '张  靖', 37: '张  靖', 30: '孟  燕', 22: '孟  燕', 27: '孙爱霞', 12: '孙爱霞', 32: '鄢雪峰', 33: '鄢雪峰', 18: '鄢雪峰', 6: '张丽丽', 14: '张丽丽', 16: '李耀国', 2: '李耀国', 13: '张文辉', 35: '马  强', 36: '马  萍', 28: '许  莉', 39: '于德顺'}, 17: {7: '刘  丽', 4: '刘  丽', 12: '刘  丽', 15: '刘  丽', 11: '刘  丽', 20: '刘  丽', 21: '刘  丽', 27: '刘  丽', 26: '刘  丽', 38: '刘  丽', 39: '刘  丽', 5: '王克燕', 10: '王克燕', 22: '王克燕', 40: '王克燕', 6: '李  婷', 9: '李  婷', 18: '李  婷', 30: '李  婷', 37: '李  婷', 34: '常  苗', 19: '常  苗', 17: '徐  冉', 31: '徐  冉', 3: '鄢雪峰', 13: '鄢雪峰', 25: '鄢雪峰', 16: '张丽丽', 35: '张丽丽', 28: '李耀国', 33: '李耀国', 29: '张文辉', 36: '马  强', 14: '马  萍', 32: '许  莉', 2: '乔海宁'}, 18: {4: '卫  奇', 5: '卫  奇', 15: '卫  奇', 16: '卫  奇', 17: '卫  奇', 19: '卫  奇', 26: '卫  奇', 31: '卫  奇', 33: '卫  奇', 36: '卫  奇', 7: '齐苡敏', 12: '齐苡敏', 18: '齐苡敏', 28: '齐苡敏', 34: '齐苡敏', 2: '李  婷', 11: '李  婷', 20: '李  婷', 27: '李  婷', 38: '李  婷', 10: '孟  燕', 29: '孟  燕', 9: '徐  冉', 21: '徐  冉', 14: '鄢雪峰', 37: '鄢雪峰', 30: '鄢雪峰', 39: '张丽丽', 3: '张丽丽', 13: '李耀国', 22: '李耀国', 32: '张文辉', 6: '马  强', 25: '马  萍', 40: '许  莉', 35: '乔海宁'}}]
	# for i in whileIndex[0]:
	# 	print(i)
	# print(whileIndex[0][1][5])
	# excelWrite(whileIndex[0],"课表2")
	excelWrite(whileIndex[1], masterTeacherList,"老师课表")
	# print(checkWight(whileIndex[0]))