# -*- coding: utf-8 -*-
import configparser as ConfigParser
import pandas as pd
import numpy as np
import string
import os
import sys
import xlrd
import xlwt
masterSubject=[5,0,2,0,0,0,2,1,1,3,0,2,0,2,2,0,1,0]
classA=[6,6,5,2,2,3,2,3,1,1,1,1,1]
classB=[11,5,5,2,2,3,2,2,1,1,1,1,1]

def excelRead():
	teacherExcel=pd.read_excel("C:/Users/sky/Desktop/课表/2019.9月人事安排表(2019.8.25).xlsx", encoding='UTF-8')
	# data=teacherExcel.loc[:,["班级"]]
	# print(teacherExcel.loc[[0,17]])
	# print(teacherExcel.loc[:,["班主任"]].values)
	# print(len(teacherExcel.columns.values))
	# print(np.delete(teacherExcel.columns.values,0))
	# # print(teacherExcel.columns.values[16])
	# print(teacherExcel.loc[:,teacherExcel.columns.values[0]].values)
	print(teacherExcel.loc[0].values)
	print(type(teacherExcel.loc[0].values))
def conf():
	conf_par = ConfigParser.RawConfigParser(allow_no_value=True)
	conf_par.read("config.conf", encoding='UTF-8')
	all_sections = conf_par.sections()
	try:
		# 所有模块
		print(all_sections)
		# 获取所有options
		print(conf_par.options("班主任"))
		print(conf_par.options("班主任")[1])

		# 获取对应的值
		print(conf_par.get("班主任","武广英"))
	except ConfigParser.NoOptionError:
		print(ConfigParser.NoOptionError)


def classTakeOutMaster(classNum):
    # 班级号是从1开始的
    if classNum<=4:
        classSubjectNum = classA.copy()
        classSubjectNum[masterSubject[classNum-1]]=classSubjectNum[masterSubject[classNum-1]]-1
        return classSubjectNum
    else:
        classSubjectNum = classB.copy()
        classSubjectNum[masterSubject[classNum-1]] = classSubjectNum[masterSubject[classNum-1]] - 1
        return classSubjectNum
def NumToList(numList):
	lastSubjectList=[]
	for num in numList:
		a=[num//5]*(5-num%5)
		b=[num//5+1]*(num%5)
		c=a+b
		lastSubjectList.append(c)
	return lastSubjectList

class mycopy():
	def __init__(self):
		self.copyTest()

	def copyTest(self):
		self.a={'name':[1,2,3,4]}

def test1(argu):
	d=argu.a.copy()
	c=d.copy()
	print(argu.a)
	c['name'].remove(1)
	print(c)
	print(argu.a)

def numToDay(numList):
	dayList={}
	for i in numList:
		i=i-1
		if i//8 in dayList.keys():
			dayList[i//8].append(i%8)
		else:
			dayList.update({i//8:[i%8]})
	# print(dayList)
	# print(dayList.keys())
	# print(len(dayList))
	# print(list(dayList.keys())[1])
	return dayList


def excelWrite(classdict,excelName):
	book = xlwt.Workbook()  # 新建一个excel
	titleRow = ["星期一", "星期二", "星期三", "星期四", "星期五"]
	titleCol = ["第1节", "第2节", "第3节", "第4节", "第5节", "第6节", "第7节", "第8节"]
	for classNum in classdict:
		sheet = book.add_sheet(str(classNum)+'班')  # 添加一个sheet页
		row=0
		while(row<=7):
			sheet.write(row+1,0,titleCol[row])
			row=row+1
		col=0
		while(col<=4):
			sheet.write(0,col+1,titleRow[col])
			col=col+1
		for timeNum in classdict[classNum]:
			sheet.write((timeNum-1)%8+1,(timeNum-1)//8+1,classdict[classNum][timeNum])
	book.save('C:/Users/sky/Desktop/课表/'+excelName+'.xls')

if __name__ == '__main__':
	# excelRead()
	# a={"班主任":[{"qq":[1,2]},{"ww":[3,4]}]}
	# print(a["班主任"][0]["qq"])
	# b=mycopy()
	# # print(b.a)
	# # c=b.a.copy()
	# # c.remove(1)
	# # print(b.a)
	# test1(b)
	# b = mycopy()
	# test1(b)
	# a=[1,3,5,7,9,34,23,8,40,24,37]
	# numToDay(a)
	# i=1
	# while(i<=18):
	# 	print(i)
	# 	test=classTakeOutMaster(i)
	# 	print(test)
	# 	print(NumToList(test))
	# 	i=i+1
	whileIndex=[{1: {5: '语文', 16: '语文', 17: '语文', 26: '语文', 34: '语文', 37: '语文', 3: '数 学', 15: '数 学', 20: '数 学', 25: '数 学', 39: '数 学', 36: '数 学', 4: '英语', 12: '英语', 18: '英语', 31: '英语', 35: '英语', 29: '政 治', 11: '政 治', 33: '生 物', 6: '生 物', 7: '历 史', 14: '历 史', 32: '地 理', 19: '地 理', 27: '体 育', 38: '体 育', 10: '体 育', 40: '音 乐', 21: '美 术', 13: '健 康', 22: '信 息', 9: '综合实践'}, 2: {2: '语文', 16: '语文', 18: '语文', 30: '语文', 34: '语文', 7: '数 学', 13: '数 学', 14: '数 学', 17: '数 学', 31: '数 学', 39: '数 学', 6: '英语', 12: '英语', 19: '英语', 29: '英语', 40: '英语', 5: '政 治', 28: '政 治', 20: '生 物', 4: '生 物', 3: '历 史', 15: '历 史', 38: '历 史', 22: '地 理', 11: '地 理', 33: '体 育', 21: '体 育', 32: '体 育', 26: '音 乐', 10: '美 术', 37: '健 康', 9: '信 息', 36: '综合实践'}, 3: {3: '语文', 10: '语文', 19: '语文', 28: '语文', 27: '语文', 36: '语文', 2: '数 学', 14: '数 学', 20: '数 学', 32: '数 学', 40: '数 学', 35: '数 学', 5: '英语', 12: '英语', 22: '英语', 29: '英语', 34: '政 治', 25: '政 治', 18: '生 物', 4: '生 物', 17: '历 史', 15: '历 史', 26: '历 史', 30: '地 理', 16: '地 理', 11: '体 育', 31: '体 育', 6: '体 育', 21: '音 乐', 33: '美 术', 7: '健 康', 13: '信 息', 38: '综合实践'}, 4: {3: '语文', 9: '语文', 19: '语文', 32: '语文', 39: '语文', 2: '数 学', 11: '数 学', 22: '数 学', 17: '数 学', 28: '数 学', 37: '数 学', 5: '英语', 14: '英语', 21: '英语', 31: '英语', 36: '英语', 25: '政 治', 16: '政 治', 29: '生 物', 7: '生 物', 35: '历 史', 27: '历 史', 6: '历 史', 12: '地 理', 4: '地 理', 26: '体 育', 20: '体 育', 13: '体 育', 10: '音 乐', 18: '美 术', 15: '健 康', 38: '信 息', 40: '综合实践'}, 5: {6: '语文', 2: '语文', 9: '语文', 11: '语文', 18: '语文', 17: '语文', 28: '语文', 31: '语文', 34: '语文', 37: '语文', 5: '数 学', 15: '数 学', 22: '数 学', 27: '数 学', 40: '数 学', 7: '英语', 14: '英语', 19: '英语', 30: '英语', 33: '英语', 39: '政 治', 26: '政 治', 21: '生 物', 32: '生 物', 10: '历 史', 36: '历 史', 25: '历 史', 13: '地 理', 20: '地 理', 38: '体 育', 4: '体 育', 12: '音 乐', 29: '美 术', 3: '健 康', 16: '信 息', 35: '综合实践'}, 6: {2: '语文', 7: '语文', 14: '语文', 9: '语文', 19: '语文', 18: '语文', 26: '语文', 29: '语文', 34: '语文', 39: '语文', 3: '数 学', 13: '数 学', 21: '数 学', 28: '数 学', 38: '数 学', 4: '英语', 15: '英语', 22: '英语', 25: '英语', 36: '英语', 20: '政 治', 10: '政 治', 17: '生 物', 30: '生 物', 40: '历 史', 16: '历 史', 5: '历 史', 33: '地 理', 6: '地 理', 27: '体 育', 12: '体 育', 32: '音 乐', 31: '美 术', 11: '健 康', 35: '信 息', 37: '综合实践'}, 7: {3: '语文', 7: '语文', 10: '语文', 15: '语文', 9: '语文', 22: '语文', 17: '语文', 28: '语文', 26: '语文', 37: '语文', 34: '语文', 2: '数 学', 16: '数 学', 19: '数 学', 25: '数 学', 36: '数 学', 6: '英语', 12: '英语', 18: '英语', 29: '英语', 14: '政 治', 33: '政 治', 5: '生 物', 21: '生 物', 39: '历 史', 27: '历 史', 20: '历 史', 35: '地 理', 31: '地 理', 40: '体 育', 13: '体 育', 38: '音 乐', 4: '美 术', 32: '健 康', 11: '信 息', 30: '综合实践'}, 8: {2: '语文', 6: '语文', 5: '语文', 12: '语文', 9: '语文', 19: '语文', 18: '语文', 32: '语文', 29: '语文', 36: '语文', 37: '语文', 15: '数 学', 20: '数 学', 28: '数 学', 38: '数 学', 7: '英语', 10: '英语', 22: '英语', 26: '英语', 39: '英语', 14: '政 治', 3: '政 治', 17: '生 物', 27: '生 物', 34: '历 史', 31: '历 史', 21: '历 史', 25: '地 理', 4: '地 理', 30: '体 育', 16: '体 育', 13: '音 乐', 35: '美 术', 40: '健 康', 33: '信 息', 11: '综合实践'}, 9: {3: '语文', 5: '语文', 15: '语文', 9: '语文', 11: '语文', 22: '语文', 18: '语文', 29: '语文', 25: '语文', 37: '语文', 35: '语文', 14: '数 学', 17: '数 学', 27: '数 学', 33: '数 学', 7: '英语', 10: '英语', 20: '英语', 28: '英语', 40: '英语', 38: '政 治', 13: '政 治', 19: '生 物', 36: '生 物', 26: '历 史', 4: '历 史', 12: '历 史', 6: '地 理', 34: '地 理', 2: '体 育', 31: '体 育', 16: '音 乐', 21: '美 术', 30: '健 康', 39: '信 息', 32: '综合实践'}, 10: {4: '语文', 2: '语文', 16: '语文', 11: '语文', 10: '语文', 18: '语文', 20: '语文', 31: '语文', 27: '语文', 37: '语文', 33: '语文', 5: '数 学', 13: '数 学', 17: '数 学', 26: '数 学', 34: '数 学', 6: '英语', 9: '英语', 19: '英语', 25: '英语', 36: '英语', 3: '政 治', 22: '生 物', 15: '生 物', 29: '历 史', 35: '历 史', 14: '历 史', 12: '地 理', 21: '地 理', 28: '体 育', 7: '体 育', 30: '音 乐', 38: '美 术', 40: '健 康', 32: '信 息', 39: '综合实践'}, 11: {6: '语文', 2: '语文', 11: '语文', 12: '语文', 20: '语文', 19: '语文', 25: '语文', 29: '语文', 37: '语文', 40: '语文', 5: '数 学', 15: '数 学', 18: '数 学', 28: '数 学', 38: '数 学', 3: '英语', 14: '英语', 22: '英语', 30: '英语', 35: '英语', 16: '政 治', 39: '政 治', 7: '生 物', 26: '生 物', 32: '历 史', 17: '历 史', 33: '历 史', 31: '地 理', 10: '地 理', 34: '体 育', 21: '体 育', 9: '音 乐', 36: '美 术', 13: '健 康', 27: '信 息', 4: '综合实践'}, 12: {2: '语文', 4: '语文', 16: '语文', 12: '语文', 10: '语文', 17: '语文', 19: '语文', 29: '语文', 26: '语文', 33: '语文', 34: '语文', 6: '数 学', 15: '数 学', 22: '数 学', 25: '数 学', 39: '数 学', 3: '英语', 14: '英语', 32: '英语', 35: '英语', 13: '政 治', 30: '政 治', 38: '生 物', 11: '生 物', 20: '历 史', 5: '历 史', 40: '历 史', 37: '地 理', 18: '地 理', 36: '体 育', 7: '体 育', 27: '音 乐', 28: '美 术', 21: '健 康', 31: '信 息', 9: '综合实践'}, 13: {6: '语文', 5: '语文', 15: '语文', 12: '语文', 18: '语文', 19: '语文', 26: '语文', 28: '语文', 33: '语文', 38: '语文', 7: '数 学', 14: '数 学', 21: '数 学', 32: '数 学', 35: '数 学', 2: '英语', 10: '英语', 20: '英语', 31: '英语', 37: '英语', 4: '政 治', 13: '政 治', 40: '生 物', 3: '生 物', 16: '历 史', 25: '历 史', 22: '历 史', 17: '地 理', 27: '地 理', 11: '体 育', 34: '体 育', 9: '音 乐', 29: '美 术', 39: '健 康', 36: '信 息', 30: '综合实践'}, 14: {4: '语文', 3: '语文', 16: '语文', 11: '语文', 21: '语文', 17: '语文', 18: '语文', 28: '语文', 32: '语文', 34: '语文', 39: '语文', 7: '数 学', 10: '数 学', 22: '数 学', 27: '数 学', 33: '数 学', 2: '英语', 9: '英语', 29: '英语', 38: '英语', 20: '政 治', 6: '政 治', 19: '生 物', 35: '生 物', 25: '历 史', 36: '历 史', 5: '历 史', 15: '地 理', 26: '地 理', 14: '体 育', 40: '体 育', 37: '音 乐', 31: '美 术', 12: '健 康', 30: '信 息', 13: '综合实践'}, 15: {2: '语文', 6: '语文', 10: '语文', 12: '语文', 19: '语文', 20: '语文', 31: '语文', 30: '语文', 33: '语文', 40: '语文', 37: '语文', 7: '数 学', 9: '数 学', 21: '数 学', 27: '数 学', 34: '数 学', 5: '英语', 16: '英语', 32: '英语', 38: '英语', 22: '政 治', 26: '政 治', 13: '生 物', 4: '生 物', 39: '历 史', 18: '历 史', 28: '历 史', 11: '地 理', 35: '地 理', 17: '体 育', 15: '体 育', 29: '音 乐', 3: '美 术', 25: '健 康', 14: '信 息', 36: '综合实践'}, 16: {5: '语文', 7: '语文', 16: '语文', 11: '语文', 22: '语文', 18: '语文', 25: '语文', 31: '语文', 35: '语文', 36: '语文', 3: '数 学', 9: '数 学', 17: '数 学', 27: '数 学', 34: '数 学', 6: '英语', 12: '英语', 20: '英语', 29: '英语', 33: '英语', 38: '政 治', 15: '政 治', 39: '生 物', 2: '生 物', 40: '历 史', 30: '历 史', 21: '历 史', 37: '地 理', 32: '地 理', 13: '体 育', 4: '体 育', 26: '音 乐', 19: '美 术', 28: '健 康', 10: '信 息', 14: '综合实践'}, 17: {2: '语文', 4: '语文', 10: '语文', 9: '语文', 21: '语文', 17: '语文', 27: '语文', 28: '语文', 33: '语文', 40: '语文', 37: '语文', 3: '数 学', 18: '数 学', 31: '数 学', 38: '数 学', 6: '英语', 15: '英语', 19: '英语', 32: '英语', 39: '英语', 36: '政 治', 26: '政 治', 5: '生 物', 29: '生 物', 35: '历 史', 13: '历 史', 20: '历 史', 25: '地 理', 22: '地 理', 30: '体 育', 16: '体 育', 7: '音 乐', 34: '美 术', 11: '健 康', 12: '信 息', 14: '综合实践'}, 18: {5: '语文', 3: '语文', 16: '语文', 15: '语文', 17: '语文', 19: '语文', 31: '语文', 30: '语文', 38: '语文', 36: '语文', 7: '数 学', 14: '数 学', 18: '数 学', 25: '数 学', 39: '数 学', 2: '英语', 12: '英语', 22: '英语', 28: '英语', 35: '英语', 11: '政 治', 21: '政 治', 20: '生 物', 6: '生 物', 4: '历 史', 32: '历 史', 33: '历 史', 10: '地 理', 26: '地 理', 37: '体 育', 29: '体 育', 40: '音 乐', 27: '美 术', 13: '健 康', 9: '信 息', 34: '综合实践'}}, {1: {5: '耿  欢', 16: '耿  欢', 17: '耿  欢', 26: '耿  欢', 34: '耿  欢', 37: '耿  欢', 3: '赵天珍', 15: '赵天珍', 20: '赵天珍', 25: '赵天珍', 39: '赵天珍', 36: '赵天珍', 4: '李冬梅', 12: '李冬梅', 18: '李冬梅', 31: '李冬梅', 35: '李冬梅', 29: '胡小丽', 11: '胡小丽', 33: '李秀萍', 6: '李秀萍', 7: '武广英', 14: '武广英', 32: '黄丽娟', 19: '黄丽娟', 27: '王  瑞', 38: '王  瑞', 10: '王  瑞', 40: '张  艳', 21: '刘  敏', 13: '邵梦婷', 22: '李雪芹', 9: '刘  婧'}, 2: {2: '徐盛轶', 16: '徐盛轶', 18: '徐盛轶', 30: '徐盛轶', 34: '徐盛轶', 7: '李  琴', 13: '李  琴', 14: '李  琴', 17: '李  琴', 31: '李  琴', 39: '李  琴', 6: '席志扬', 12: '席志扬', 19: '席志扬', 29: '席志扬', 40: '席志扬', 5: '孟  燕', 28: '孟  燕', 20: '李秀萍', 4: '李秀萍', 3: '武广英', 15: '武广英', 38: '武广英', 22: '黄丽娟', 11: '黄丽娟', 33: '王  瑞', 21: '王  瑞', 32: '王  瑞', 26: '张  艳', 10: '刘  敏', 37: '邵梦婷', 9: '李雪芹', 36: '刘  婧'}, 3: {3: '徐盛轶', 10: '徐盛轶', 19: '徐盛轶', 28: '徐盛轶', 27: '徐盛轶', 36: '徐盛轶', 2: '曹卫兵', 14: '曹卫兵', 20: '曹卫兵', 32: '曹卫兵', 40: '曹卫兵', 35: '曹卫兵', 5: '张瑞华', 12: '张瑞华', 22: '张瑞华', 29: '张瑞华', 34: '胡小丽', 25: '胡小丽', 18: '徐  冉', 4: '徐  冉', 17: '尹淑英', 15: '尹淑英', 26: '尹淑英', 30: '黄丽娟', 16: '黄丽娟', 11: '王  瑞', 31: '王  瑞', 6: '王  瑞', 21: '张  艳', 33: '刘  敏', 7: '邵梦婷', 13: '李雪芹', 38: '刘  婧'}, 4: {3: '耿  欢', 9: '耿  欢', 19: '耿  欢', 32: '耿  欢', 39: '耿  欢', 2: '田月红', 11: '田月红', 22: '田月红', 17: '田月红', 28: '田月红', 37: '田月红', 5: '王奕涵', 14: '王奕涵', 21: '王奕涵', 31: '王奕涵', 36: '王奕涵', 25: '孟  燕', 16: '孟  燕', 29: '李秀萍', 7: '李秀萍', 35: '武广英', 27: '武广英', 6: '武广英', 12: '黄丽娟', 4: '黄丽娟', 26: '王  瑞', 20: '王  瑞', 13: '王  瑞', 10: '张  艳', 18: '刘  敏', 15: '邵梦婷', 38: '李雪芹', 40: '刘  婧'}, 5: {6: '傅婷婷', 2: '傅婷婷', 9: '傅婷婷', 11: '傅婷婷', 18: '傅婷婷', 17: '傅婷婷', 28: '傅婷婷', 31: '傅婷婷', 34: '傅婷婷', 37: '傅婷婷', 5: '雷桂敏', 15: '雷桂敏', 22: '雷桂敏', 27: '雷桂敏', 40: '雷桂敏', 7: '袁  彬', 14: '袁  彬', 19: '袁  彬', 30: '袁  彬', 33: '袁  彬', 39: '胡小丽', 26: '胡小丽', 21: '李秀萍', 32: '李秀萍', 10: '武广英', 36: '武广英', 25: '武广英', 13: '黄丽娟', 20: '黄丽娟', 38: '马韶佳', 4: '马韶佳', 12: '张  艳', 29: '刘  敏', 3: '邵梦婷', 16: '李雪芹', 35: '刘  婧'}, 6: {2: '程马利', 7: '程马利', 14: '程马利', 9: '程马利', 19: '程马利', 18: '程马利', 26: '程马利', 29: '程马利', 34: '程马利', 39: '程马利', 3: '王  莉', 13: '王  莉', 21: '王  莉', 28: '王  莉', 38: '王  莉', 4: '樊妍妍', 15: '樊妍妍', 22: '樊妍妍', 25: '樊妍妍', 36: '樊妍妍', 20: '胡小丽', 10: '胡小丽', 17: '李秀萍', 30: '李秀萍', 40: '武广英', 16: '武广英', 5: '武广英', 33: '黄丽娟', 6: '黄丽娟', 27: '马韶佳', 12: '马韶佳', 32: '张  艳', 31: '刘  敏', 11: '邵梦婷', 35: '李雪芹', 37: '刘  婧'}, 7: {3: '崔  媛', 7: '崔  媛', 10: '崔  媛', 15: '崔  媛', 9: '崔  媛', 22: '崔  媛', 17: '崔  媛', 28: '崔  媛', 26: '崔  媛', 37: '崔  媛', 34: '崔  媛', 2: '闫海萍', 16: '闫海萍', 19: '闫海萍', 25: '闫海萍', 36: '闫海萍', 6: '樊妍妍', 12: '樊妍妍', 18: '樊妍妍', 29: '樊妍妍', 14: '胡小丽', 33: '胡小丽', 5: '王  芳', 21: '王  芳', 39: '刘  洋', 27: '刘  洋', 20: '刘  洋', 35: '黄丽娟', 31: '黄丽娟', 40: '马韶佳', 13: '马韶佳', 38: '张  艳', 4: '韩  晓', 32: '邵梦婷', 11: '李雪芹', 30: '刘  婧'}, 8: {2: '王  慧', 6: '王  慧', 5: '王  慧', 12: '王  慧', 9: '王  慧', 19: '王  慧', 18: '王  慧', 32: '王  慧', 29: '王  慧', 36: '王  慧', 37: '王  慧', 15: '李  琴', 20: '李  琴', 28: '李  琴', 38: '李  琴', 7: '王奕涵', 10: '王奕涵', 22: '王奕涵', 26: '王奕涵', 39: '王奕涵', 14: '蔡晓娟', 3: '蔡晓娟', 17: '王  芳', 27: '王  芳', 34: '刘  洋', 31: '刘  洋', 21: '刘  洋', 25: '严承磊', 4: '严承磊', 30: '马韶佳', 16: '马韶佳', 13: '张  艳', 35: '韩  晓', 40: '邵梦婷', 33: '李雪芹', 11: '刘  婧'}, 9: {3: '张  洁', 5: '张  洁', 15: '张  洁', 9: '张  洁', 11: '张  洁', 22: '张  洁', 18: '张  洁', 29: '张  洁', 25: '张  洁', 37: '张  洁', 35: '张  洁', 14: '常  昊', 17: '常  昊', 27: '常  昊', 33: '常  昊', 7: '李冬梅', 10: '李冬梅', 20: '李冬梅', 28: '李冬梅', 40: '李冬梅', 38: '胡小丽', 13: '胡小丽', 19: '王  芳', 36: '王  芳', 26: '刘  洋', 4: '刘  洋', 12: '刘  洋', 6: '严承磊', 34: '严承磊', 2: '马韶佳', 31: '马韶佳', 16: '张  艳', 21: '韩  晓', 30: '张丽丽', 39: '李雪芹', 32: '于德顺'}, 10: {4: '邓春燕', 2: '邓春燕', 16: '邓春燕', 11: '邓春燕', 10: '邓春燕', 18: '邓春燕', 20: '邓春燕', 31: '邓春燕', 27: '邓春燕', 37: '邓春燕', 33: '邓春燕', 5: '赵天珍', 13: '赵天珍', 17: '赵天珍', 26: '赵天珍', 34: '赵天珍', 6: '张瑞华', 9: '张瑞华', 19: '张瑞华', 25: '张瑞华', 36: '张瑞华', 3: '胡小丽', 22: '王  芳', 15: '王  芳', 29: '刘  洋', 35: '刘  洋', 14: '刘  洋', 12: '严承磊', 21: '严承磊', 28: '马韶佳', 7: '马韶佳', 30: '张  艳', 38: '韩  晓', 40: '张丽丽', 32: '李雪芹', 39: '于德顺'}, 11: {6: '王  晓', 2: '王  晓', 11: '王  晓', 12: '王  晓', 20: '王  晓', 19: '王  晓', 25: '王  晓', 29: '王  晓', 37: '王  晓', 40: '王  晓', 5: '闫海萍', 15: '闫海萍', 18: '闫海萍', 28: '闫海萍', 38: '闫海萍', 3: '许  阳', 14: '许  阳', 22: '许  阳', 30: '许  阳', 35: '许  阳', 16: '蔡晓娟', 39: '蔡晓娟', 7: '王  芳', 26: '王  芳', 32: '刘  洋', 17: '刘  洋', 33: '刘  洋', 31: '严承磊', 10: '严承磊', 34: '马韶佳', 21: '马韶佳', 9: '张  艳', 36: '韩  晓', 13: '张丽丽', 27: '李雪芹', 4: '于德顺'}, 12: {2: '虎生梅', 4: '虎生梅', 16: '虎生梅', 12: '虎生梅', 10: '虎生梅', 17: '虎生梅', 19: '虎生梅', 29: '虎生梅', 26: '虎生梅', 33: '虎生梅', 34: '虎生梅', 6: '常  昊', 15: '常  昊', 22: '常  昊', 25: '常  昊', 39: '常  昊', 3: '高秀芳', 14: '高秀芳', 32: '高秀芳', 35: '高秀芳', 13: '蔡晓娟', 30: '蔡晓娟', 38: '孙爱霞', 11: '孙爱霞', 20: '葛雅卉', 5: '葛雅卉', 40: '葛雅卉', 37: '严承磊', 18: '严承磊', 36: '李耀国', 7: '李耀国', 27: '张文辉', 28: '韩  晓', 21: '张丽丽', 31: '李雪芹', 9: '于德顺'}, 13: {6: '张银玉', 5: '张银玉', 15: '张银玉', 12: '张银玉', 18: '张银玉', 19: '张银玉', 26: '张银玉', 28: '张银玉', 33: '张银玉', 38: '张银玉', 7: '王克燕', 14: '王克燕', 21: '王克燕', 32: '王克燕', 35: '王克燕', 2: '高秀芳', 10: '高秀芳', 20: '高秀芳', 31: '高秀芳', 37: '高秀芳', 4: '孟  燕', 13: '孟  燕', 40: '孙爱霞', 3: '孙爱霞', 16: '葛雅卉', 25: '葛雅卉', 22: '葛雅卉', 17: '严承磊', 27: '严承磊', 11: '李耀国', 34: '李耀国', 9: '张文辉', 29: '马  强', 39: '张丽丽', 36: '许  莉', 30: '于德顺'}, 14: {4: '马  伟', 3: '马  伟', 16: '马  伟', 11: '马  伟', 21: '马  伟', 17: '马  伟', 18: '马  伟', 28: '马  伟', 32: '马  伟', 34: '马  伟', 39: '马  伟', 7: '王  莉', 10: '王  莉', 22: '王  莉', 27: '王  莉', 33: '王  莉', 2: '许  阳', 9: '许  阳', 29: '许  阳', 38: '许  阳', 20: '孟  燕', 6: '孟  燕', 19: '孙爱霞', 35: '孙爱霞', 25: '鄢雪峰', 36: '鄢雪峰', 5: '鄢雪峰', 15: '严承磊', 26: '严承磊', 14: '李耀国', 40: '李耀国', 37: '张文辉', 31: '马  强', 12: '马  萍', 30: '许  莉', 13: '于德顺'}, 15: {2: '张  菲', 6: '张  菲', 10: '张  菲', 12: '张  菲', 19: '张  菲', 20: '张  菲', 31: '张  菲', 30: '张  菲', 33: '张  菲', 40: '张  菲', 37: '张  菲', 7: '田月红', 9: '田月红', 21: '田月红', 27: '田月红', 34: '田月红', 5: '张  靖', 16: '张  靖', 32: '张  靖', 38: '张  靖', 22: '孟  燕', 26: '孟  燕', 13: '孙爱霞', 4: '孙爱霞', 39: '鄢雪峰', 18: '鄢雪峰', 28: '鄢雪峰', 11: '张丽丽', 35: '张丽丽', 17: '李耀国', 15: '李耀国', 29: '张文辉', 3: '马  强', 25: '马  萍', 14: '许  莉', 36: '于德顺'}, 16: {5: '刘国栋', 7: '刘国栋', 16: '刘国栋', 11: '刘国栋', 22: '刘国栋', 18: '刘国栋', 25: '刘国栋', 31: '刘国栋', 35: '刘国栋', 36: '刘国栋', 3: '齐苡敏', 9: '齐苡敏', 17: '齐苡敏', 27: '齐苡敏', 34: '齐苡敏', 6: '张  靖', 12: '张  靖', 20: '张  靖', 29: '张  靖', 33: '张  靖', 38: '孟  燕', 15: '孟  燕', 39: '孙爱霞', 2: '孙爱霞', 40: '鄢雪峰', 30: '鄢雪峰', 21: '鄢雪峰', 37: '张丽丽', 32: '张丽丽', 13: '李耀国', 4: '李耀国', 26: '张文辉', 19: '马  强', 28: '马  萍', 10: '许  莉', 14: '于德顺'}, 17: {2: '刘  丽', 4: '刘  丽', 10: '刘  丽', 9: '刘  丽', 21: '刘  丽', 17: '刘  丽', 27: '刘  丽', 28: '刘  丽', 33: '刘  丽', 40: '刘  丽', 37: '刘  丽', 3: '王克燕', 18: '王克燕', 31: '王克燕', 38: '王克燕', 6: '李  婷', 15: '李  婷', 19: '李  婷', 32: '李  婷', 39: '李  婷', 36: '常  苗', 26: '常  苗', 5: '徐  冉', 29: '徐  冉', 35: '鄢雪峰', 13: '鄢雪峰', 20: '鄢雪峰', 25: '张丽丽', 22: '张丽丽', 30: '李耀国', 16: '李耀国', 7: '张文辉', 34: '马  强', 11: '马  萍', 12: '许  莉', 14: '乔海宁'}, 18: {5: '卫  奇', 3: '卫  奇', 16: '卫  奇', 15: '卫  奇', 17: '卫  奇', 19: '卫  奇', 31: '卫  奇', 30: '卫  奇', 38: '卫  奇', 36: '卫  奇', 7: '齐苡敏', 14: '齐苡敏', 18: '齐苡敏', 25: '齐苡敏', 39: '齐苡敏', 2: '李  婷', 12: '李  婷', 22: '李  婷', 28: '李  婷', 35: '李  婷', 11: '孟  燕', 21: '孟  燕', 20: '徐  冉', 6: '徐  冉', 4: '鄢雪峰', 32: '鄢雪峰', 33: '鄢雪峰', 10: '张丽丽', 26: '张丽丽', 37: '李耀国', 29: '李耀国', 40: '张文辉', 27: '马  强', 13: '马  萍', 9: '许  莉', 34: '乔海宁'}}]
	# for i in whileIndex[0]:
	# 	print(i)
	# print(whileIndex[0][1][5])
	excelWrite(whileIndex[0],"课表")
	excelWrite(whileIndex[1], "老师课表")